Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: This initializer creates asynchronous work on behalf of the synchronous function that calls it.
ja: このイニシャライザは、非同期作業を、それを呼び出す同期関数の代わりに作成します。

source: This initializer does not perform any range or overflow checking.
ja: このイニシャライザは、全く範囲またはオーバーフロー検査を実行しません。

source: This initializer does not try to repair ill-formed UTF-8 code unit sequences.
ja: このイニシャライザは、誤形式UTF-8コード単位シーケンスの修復を試みません。

source: This initializer throws an error if reading from the decoder fails, or if the data read is corrupted or otherwise invalid.
ja: このイニシャライザは、デコーダからの読み出しが失敗するならば、または読み込んだデータが不正またはそうでなくとも無効ならば、エラーをスローします。

source: This initializer works with any type, and uses the custom debugDescription property for types that conform to CustomDebugStringConvertible:
ja: このイニシャライザはどんな型とでも働きます、そしてあつらえのdebugDescriptionプロパティをCustomDebugStringConvertibleに準拠する型に対して使います：

source: This initializer works with any type, and uses the custom description property for types that conform to CustomStringConvertible:
ja: このイニシャライザはどんな型とでも働きます、そしてあつらえのdescriptionプロパティをCustomStringConvertibleに準拠する型に対して使います：

source: This is a demonstration only—if you need the Unicode scalar representation of a string, use its unicodeScalars view.
ja: これは単に１つの実演です—あなたがある文字列のユニコードスカラー表現を必要とするならば、それのunicodeScalarsビューを使ってください。

source: This is an optimized type used internally by the core scheduling operations.
ja: これは、コアスケジューリング演算によって内部的に使われるある最適化された型です。

source: This is equivalent to the inverse of a set.
ja: これはある集合の逆と等しいです。

source: This is identical to init(cString: UnsafePointer<CChar>) but operates on an unsigned sequence of bytes.
ja: これは、init(cString: UnsafePointer<CChar>)と同一です、しかし符号なしバイトシーケンス上で作動します。

source: This is meant to be passed to String.reserveCapacity(_:); it may be slightly larger or smaller than the sum of the counts of each literal segment.
ja: これはString.reserveCapacity(_:)に渡されるよう意図されます；それは各リテラル文節を計算する合計より少しばかり大きいか小さいかもしれません。

source: This is the default implementation of the greater-than operator (>) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対して、より大きい演算子（>）の初期状態の実装です。

source: This is the default implementation of the greater-than-or-equal-to operator (>=) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対して、より大きいか等しい演算子（>=）の初期状態の実装です。

source: This is the default implementation of the less-than-or-equal-to operator (<=) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対して、より少ないか等しい演算子（<=）の初期状態の実装です。

source: This is the default implementation of the not-equal-to operator (!=) for any type that conforms to Equatable.
ja: Equatableに準拠するあらゆる型に対して、不等演算子（!=）の初期状態の実装です。

source: This is useful when a function returns an unmanaged reference and you know that you’re not responsible for releasing the result.
ja: これは、ある関数が管理されない参照を返す、そしてあなたがその結果を解放することに責任を持たなくてよいことをあなたが知っているときにときに有用です。

source: This is useful when a function returns an unmanaged reference and you know that you’re responsible for releasing the result.
ja: これは、ある関数が管理されない参照を返す、そしてあなたがその結果を解放することに責任を持つことをあなたが知っているときにときに有用です。

source: This is useful when passing a reference to an API which Swift does not know the ownership rules for, but you know that the API expects you to pass the object at +0.
ja: これは、Swiftがそれについての所有権規則を知らないAPIにある参照を渡す、しかしそのAPIはあなたがオブジェクトを+0で渡すことを予期するのをあなたが知っているときに有用です。

source: This is useful when passing an object to an API which Swift does not know the ownership rules for, but you know that the API expects you to pass the object at +1.
ja: これは、Swiftがそれについての所有権規則を知らないAPIにあるオブジェクトを渡す、しかしそのAPIはあなたがオブジェクトを+1で渡すことを予期するのをあなたが知っているときに有用です。

source: This iterator terminates after all tasks have completed successfully, or after any task completes by throwing an error.
ja: このイテレータは、全てのタスクが成功裏に完了した後に終了します、または何らかのタスクがエラーをスローすることによって完了した後に。

source: This may require resizing the buffer beyond its original capacity.
ja: これは、バッファの大きさ変更を要請するかもしれません、それの元の収容能力を越えて。

source: This means that, depending on the semantics of the specific file system, conversion to a string and back to a path might result in a value that’s different from the original path.
ja: これが意味するのは、特定のファイルシステムの意味論に依存して、ある文字列へそしてパスへ戻す変換は、元のパスとは異なる値という結果になるかもしれないということです。

source: This means the outer for await in loop iterates over String instances instead of the underlying Int values that Counter produces.
ja: これは、外側のfor await inループがStringインスタンスそれらのすべてにわたって反復することを意味します、Counterが生み出す基礎をなすIntそれらではなく。

source: This means the outer for await in loop iterates over String instances instead of the underlying Int values that Counter produces:
ja: これは、外側のfor await inループがStringインスタンスそれらのすべてにわたって反復することを意味します、Counterが生み出す基礎をなすIntそれらではなく：

source: This method does not validate the encoding of a UTF-16 sequence beyond the specified code unit.
ja: このメソッドは、指定されたコード単位を越えてUTF-16シーケンスのエンコードを検証しません。

source: This method doesn’t throw an error, even if the child task does.
ja: このメソッドは、エラーをスローしません、たとえ子タスクがするとしても。

source: This method has the effect of removing the specified range of elements from the collection and inserting the new elements at the same location.
ja: このメソッドは、指定された範囲の要素をコレクションから取り除き、そして新しい要素を同じ場所に挿入する効果を持ちます。

source: This method implements the mathematical notion of lexicographical ordering, which has no connection to Unicode.
ja: このメソッドは、語彙筆記的順序の数学的概念を実装します、それはユニコードに関係はありません。

source: This method initializes the buffer with elements from source until source is exhausted or, if source is a sequence but not a collection, the buffer has no more room for its elements.
ja: このメソッドはsourceからの要素でバッファを初期化します、sourceが使い尽くされるまでまたは、sourceがシーケンスであるがコレクションではないならば、バッファがこれ以上それの要素のための部屋を持たなくなるまで。

source: This method is equivalent to calling random(in:using:), passing in the system’s default random generator.
ja: このメソッドは、random(in:using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling randomElement(using:), passing in the system’s default random generator.
ja: このメソッドは、randomElement(using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling shuffle(using:), passing in the system’s default random generator.
ja: このメソッドは、shuffle(using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling shuffled(using:), passing in the system’s default random generator.
ja: このメソッドは、shuffled(using:)を、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is equivalent to calling the version that takes a generator, passing in the system’s default random generator.
ja: このメソッドは、ある生成子をとるバージョンを、システムの持つ省略時の無作為生成子を渡して呼び出すことに相当します。

source: This method is preferred over reduce(_:_:) for efficiency when the result is a copy-on-write type, for example an Array or a Dictionary.
ja: このメソッドは、効率のためにreduce(_:_:)より好まれます、その結果がコピーオンライト型である場合、例えばArrayまたは辞書に対しては。

source: This method replaces ill-formed UTF-8 sequences with the Unicode replacement character ("\u{FFFD}").
ja: このメソッドは、誤形式UTF-8シーケンスをユニコード代替文字（"\u{FFFD}"）で置き換えます。

source: This method returns nil if the container has no elements left to decode, or if the value is null.
ja: このメソッドはnilを返します、もしコンテナがデコードするのに残る要素を持たないならば、またはもし値がnullならば。

source: This method returns a typed pointer for further typed access to the memory.
ja: このメソッドは、この後で型付アクセスをこのメモリにするために型付ポインタを返します

source: This method works regardless of whether the static string stores a pointer or a single Unicode scalar value.
ja: このメソッドは、静的文字列がポインタまたは単一ユニコードスカラー値のどちらを格納するかに関係なく働きます。

source: This numeric type includes fractions such as “⅕” (U+2155 VULGAR FRACTION ONE FIFTH), numerical CJK ideographs like “兆” (U+5146 CJK UNIFIED IDEOGRAPH-5146), and other scalars that are not decimal digits used positionally in the writing of base-10 numbers.
ja: この数値型は、分数たとえば “⅕” (U+2155 VULGAR FRACTION ONE FIFTH)、数値CJK文字の “兆” (U+5146 CJK UNIFIED IDEOGRAPH-5146) のようなもの、そして底10の数を書くのに桁区切りに使われる10進桁でない他のスカラーを含みます。

source: This operation does not change reference counts.
ja: この操作は参照カウントを変更しません。

source: This pointer must be a pointer to the start of a previously allocated memory block.
ja: このポインタは、以前にアロケートされたメモリブロックの始まりを指すポインタでなければなりません。

source: This property applies to a small number of spacing vowel letters occurring in some Southeast Asian scripts like Thai and Lao, which use a visual order display model.
ja: このプロパティは、タイ語およびラオ語のようないくつかの南東アジア書体に現れる少数の空白母音字に適用されます、それは視覚順序表示モデルを使います。

source: This property corresponds to the “ASCII_Hex_Digit” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “ASCII_Hex_Digit” に相当します。

source: This property corresponds to the “Age” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Age” に相当します。

source: This property corresponds to the “Alphabetic” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Alphabetic” に相当します。

source: This property corresponds to the “Bidi_Control” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Bidi_Control” に相当します。

source: This property corresponds to the “Bidi_Mirrored” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Bidi_Mirrored” に相当します。

source: This property corresponds to the “Canonical_Combining_Class” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Canonical_Combining_Class” に相当します。

source: This property corresponds to the “Case_Ignorable” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Case_Ignorable” に相当します。

source: This property corresponds to the “Cased” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Cased” に相当します。

source: This property corresponds to the “Changes_When_Casefolded” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Changes_When_Casefolded” に相当します。

source: This property corresponds to the “Changes_When_Casemapped” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Changes_When_Casemapped” に相当します。

source: This property corresponds to the “Changes_When_Lowercased” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Changes_When_Lowercased” に相当します。

source: This property corresponds to the “Changes_When_NFKC_Casefolded” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Changes_When_NFKC_Casefolded” に相当します。

source: This property corresponds to the “Changes_When_Titlecased” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Changes_When_Titlecased” に相当します。

source: This property corresponds to the “Changes_When_Uppercased” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Changes_When_Uppercased” に相当します。

source: This property corresponds to the “Dash” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Dash” に相当します。

source: This property corresponds to the “Default_Ignorable_Code_Point” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Default_Ignorable_Code_Point” に相当します。

source: This property corresponds to the “Deprecated” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Deprecated” に相当します。

source: This property corresponds to the “Diacritic” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Diacritic” に相当します。

source: This property corresponds to the “Emoji_Modifier_Base” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Emoji_Modifier_Base” に相当します。

source: This property corresponds to the “Emoji_Modifier” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Emoji_Modifier” に相当します。

source: This property corresponds to the “Emoji_Presentation” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Emoji_Presentation” に相当します。

source: This property corresponds to the “Emoji” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Emoji” に相当します。

source: This property corresponds to the “Extender” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Extender” に相当します。

source: This property corresponds to the “Full_Composition_Exclusion” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Full_Composition_Exclusion” に相当します。

source: This property corresponds to the “General_Category” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “General_Category” に相当します。

source: This property corresponds to the “Grapheme_Base” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Grapheme_Base” に相当します。

source: This property corresponds to the “Grapheme_Extend” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Grapheme_Extend” に相当します。

source: This property corresponds to the “Hex_Digit” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Hex_Digit” に相当します。

source: This property corresponds to the “IDS_Binary_Operator” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “IDS_Binary_Operator” に相当します。

source: This property corresponds to the “IDS_Trinary_Operator” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “IDS_Trinary_Operator” に相当します。

source: This property corresponds to the “ID_Continue” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “ID_Continue” に相当します。

source: This property corresponds to the “ID_Start” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “ID_Start” に相当します。

source: This property corresponds to the “Ideographic” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Ideographic” に相当します。

source: This property corresponds to the “Join_Control” property in the Unicode Standard.
ja: このプロパティは、Unicode Standardにおける “Join_Control” に相当します。

source: This property corresponds to the “Logical_Order_Exception” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Logical_Order_Exception” に相当します。

source: This property corresponds to the “Lowercase_Mapping” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Lowercase_Mapping” に相当します。

source: This property corresponds to the “Lowercase” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Lowercase” に相当します。

source: This property corresponds to the “Math” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Math” に相当します。

source: This property corresponds to the “Name_Alias” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Name_Alias” に相当します。

source: This property corresponds to the “Name” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Name” に相当します。

source: This property corresponds to the “Noncharacter_Code_Point” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Noncharacter_Code_Point” に相当します。

source: This property corresponds to the “Numeric_Type” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Numeric_Type” に相当します。

source: This property corresponds to the “Numeric_Value” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Numeric_Value” に相当します。

source: This property corresponds to the “Pattern_Syntax” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Pattern_Syntax” に相当します。

source: This property corresponds to the “Pattern_White_Space” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Pattern_White_Space” に相当します。

source: This property corresponds to the “Quotation_Mark” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Quotation_Mark” に相当します。

source: This property corresponds to the “Radical” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Radical” に相当します。

source: This property corresponds to the “Sentence_Terminal” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Sentence_Terminal” に相当します。

source: This property corresponds to the “Soft_Dotted” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Soft_Dotted” に相当します。

source: This property corresponds to the “Terminal_Punctuation” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Terminal_Punctuation” に相当します。

source: This property corresponds to the “Titlecase_Mapping” property in the Unicode Standard.
ja: このプロパティは、Unicode Standardにおける “Titlecase_Mapping” に相当します。

source: This property corresponds to the “Unified_Ideograph” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Unified_Ideograph” に相当します。

source: This property corresponds to the “Uppercase_Mapping” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Uppercase_Mapping” に相当します。

source: This property corresponds to the “Uppercase” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Uppercase” に相当します。

source: This property corresponds to the “Variation_Selector” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “Variation_Selector” に相当します。

source: This property corresponds to the “White_Space” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “White_Space” に相当します。

source: This property corresponds to the “XID_Continue” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “XID_Continue” に相当します。

source: This property corresponds to the “XID_Start” property in the Unicode Standard.
ja: このプロパティは、ユニコード標準における “XID_Start” に相当します。

source: This property is true for all scalars for which isASCIIHexDigit is true as well as for their CJK halfwidth and fullwidth variants.
ja: このプロパティは、それに対してisASCIIHexDigitがtrueである全てのスカラーに対して、それだけでなくそれらのCJK半角および全角異字体に対しても、trueです。

source: This property is true for scalars that are spaces, separator characters, and other control characters that should be treated as whitespace for the purposes of parsing text elements.
ja: このプロパティがtrueであるのは、空白、分離子文字、そして他の制御文字であるスカラーに対してです、それはテキスト要素を構文解析する目的のために空白として扱われるべきものです。

source: This property is true whenever one or more of changesWhenLowercased, changesWhenUppercased, or changesWhenTitlecased are true.
ja: このプロパティはtrueです、１つ以上のchangesWhenLowercased、changesWhenUppercased、またはchangesWhenTitlecasedがtrueである時はいつでも。

source: This property is a String, not a Unicode.Scalar or Character, because some mappings may transform a scalar into multiple scalars or graphemes.
ja: このプロパティは、あるStringです、Unicode.ScalarまたはCharacterではなく、なぜならいくつかのマッピングはスカラーを複数のスカラーや書記素に分解するかもしれないからです。

source: This property is always false for unsigned integer types.
ja: このプロパティは、符号なし整数型に対して常にfalseです。

source: This property is false for CJK punctuation and symbols, as well as for compatibility ideographs (which canonically decompose to unified ideographs).
ja: このプロパティは、CJK句読点およびシンボルに対してfalseです、互換表意文字だけでなく（それは統一表意文字に正準に分解されます）。

source: This property is true for scalars that are rendered as emoji by default and also for scalars that have a non-default emoji rendering when followed by U+FE0F VARIATION SELECTOR-16.
ja: このプロパティがtrueであるのは、emojiとして初期状態で描出されるスカラーに対して、そしてまたU+FE0F VARIATION SELECTOR-16が後に続く場合に描出する非初期状態emojiを持つスカラーに対してです。

source: This property roughly defines the class of “Chinese characters” and does not include characters of other logographic scripts such as Cuneiform or Egyptian Hieroglyphs.
ja: このプロパティは、おおよそ “漢字” のクラスを定義します、そして他の表意文字書体の文字、たとえば楔形またはエジブト語ヒエログリフなどを含みません。

source: This reflects the fact that a task can be canceled for many reasons, and additional reasons can accrue during the cancellation process.
ja: これは、あるタスクは多くの理由のために取り消されることがありうるという事実を反映します、そして追加的な理由は取り消しプロセスの間に収集できます。

source: This representation matches the one used when String instances are passed to C APIs.
ja: この表現は、StringインスタンスがC APIに渡される時に使われるものと一致します。

source: This sample code project is associated with WWDC21 session 10194: Swift Concurrency: Update a Sample App.
ja: この見本コードプロジェクトは、WWDC21 セッション 10194: Swift Concurrency: Update a Sample Appと関連します。

source: This sample provides two separate versions of the Coffee Tracker app:
ja: この見本は、２つの別のバージョンのCoffee Trackerアプリを提供します：

source: This type is inherently sendable and can safely be used and stored in multiple task contexts.
ja: この型は、本質的に送信可能なものです、そして安全に使われることそして複数のタスク文脈において格納されることが可能です。

source: This type must be a class so it has a stable identity, that is used as key value for lookups in the task local storage.
ja: この型は、classでなければなりません、なのでそれは安定した同一性を持ちます、それはタスクローカルストレージにおける検索それらに対するキー値として使われます。

source: This value corresponds to the category Close_Punctuation (abbreviated Pe) in the Unicode Standard.
ja: この値は、ユニコード標準における分類区分Close_Punctuation（簡略形式Pe）に相当します。

source: This value corresponds to the category Connector_Punctuation (abbreviated Pc) in the Unicode Standard.
ja: この値は、ユニコード標準におけるConnector_Punctuation（簡略形式Pc）に相当します。

source: This value corresponds to the category Control (abbreviated Cc) in the Unicode Standard.
ja: この値は、Unicode StandardにおけるControl（簡略形式Cc）に相当します。

source: This value corresponds to the category Currency_Symbol (abbreviated Sc) in the Unicode Standard.
ja: この値は、ユニコード標準におけるCurrency_Symbol（簡略形式Sc）に相当します。

source: This value corresponds to the category Dash_Punctuation (abbreviated Pd) in the Unicode Standard.
ja: この値は、ユニコード標準におけるDash_Punctuation（簡略形式Pd）に相当します。

source: This value corresponds to the category Decimal_Number (abbreviated Nd) in the Unicode Standard.
ja: この値は、ユニコード標準におけるDecimal_Number（簡略形式Nd）に相当します。

source: This value corresponds to the category Enclosing_Mark (abbreviated Me) in the Unicode Standard.
ja: この値は、ユニコード標準におけるEnclosing_Mark（簡略形式Me）に相当します。

source: This value corresponds to the category Final_Punctuation (abbreviated Pf) in the Unicode Standard.
ja: この値は、ユニコード標準におけるFinal_Punctuation（簡略形式Pf）に相当します。

source: This value corresponds to the category Format (abbreviated Cf) in the Unicode Standard.
ja: この値は、Unicode StandardにおけるFormat（簡略形式Cf）に相当します。

source: This value corresponds to the category Initial_Punctuation (abbreviated Pi) in the Unicode Standard.
ja: この値は、ユニコード標準におけるInitial_Punctuation（簡略形式Pi）に相当します。

source: This value corresponds to the category Letter_Number (abbreviated Nl) in the Unicode Standard.
ja: この値は、ユニコード標準におけるLetter_Number（簡略形式Nl）に相当します。

source: This value corresponds to the category Line_Separator (abbreviated Zl) in the Unicode Standard.
ja: この値は、ユニコード標準におけるLine_Separator（簡略形式Zl）に相当します。

source: This value corresponds to the category Lowercase_Letter (abbreviated Ll) in the Unicode Standard.
ja: この値は、ユニコード標準におけるLowercase_Letter（簡略形式Ll）に相当します。

source: This value corresponds to the category Math_Symbol (abbreviated Sm) in the Unicode Standard.
ja: この値は、ユニコード標準におけるMath_Symbol（簡略形式Sm）に相当します。

source: This value corresponds to the category Modifier_Letter (abbreviated Lm) in the Unicode Standard.
ja: この値は、ユニコード標準におけるModifier_Letter（簡略形式Lm）に相当します。

source: This value corresponds to the category Modifier_Symbol (abbreviated Sk) in the Unicode Standard.
ja: この値は、ユニコード標準におけるModifier_Symbol（簡略形式Sk）に相当します。

source: This value corresponds to the category Nonspacing_Mark (abbreviated Mn) in the Unicode Standard.
ja: この値は、ユニコード標準におけるNonspacing_Mark（簡略形式Mn）に相当します。

source: This value corresponds to the category Open_Punctuation (abbreviated Ps) in the Unicode Standard.
ja: この値は、ユニコード標準におけるOpen_Punctuation（簡略形式Ps）に相当します。

source: This value corresponds to the category Other_Letter (abbreviated Lo) in the Unicode Standard.
ja: この値は、ユニコード標準におけるOther_Letter（簡略形式Lo）に相当します。

source: This value corresponds to the category Other_Number (abbreviated No) in the Unicode Standard.
ja: この値は、ユニコード標準におけるOther_Number（簡略形式No）に相当します。

source: This value corresponds to the category Other_Punctuation (abbreviated Po) in the Unicode Standard.
ja: この値は、ユニコード標準におけるOther_Punctuation（簡略形式Po）に相当します。

source: This value corresponds to the category Other_Symbol (abbreviated So) in the Unicode Standard.
ja: この値は、ユニコード標準におけるOther_Symbol（簡略形式So）に相当します。

source: This value corresponds to the category Paragraph_Separator (abbreviated Zp) in the Unicode Standard.
ja: この値は、ユニコード標準におけるParagraph_Separator（簡略形式Zp）に相当します。

source: This value corresponds to the category Private_Use (abbreviated Co) in the Unicode Standard.
ja: この値は、ユニコード標準におけるPrivate_Use（簡略形式Co）に相当します。

source: This value corresponds to the category Space_Separator (abbreviated Zs) in the Unicode Standard.
ja: この値は、ユニコード標準におけるSpace_Separator（簡略形式Zs）に相当します。

source: This value corresponds to the category Spacing_Mark (abbreviated Mc) in the Unicode Standard.
ja: この値は、ユニコード標準におけるSpacing_Mark（簡略形式Mc）に相当します。
